# IsFilteredBySheet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..IsFilteredBySheet Property
ScheduleDefinition Class See Also
---
Indicates if the schedule is set to filter by sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool IsFilteredBySheet { get; set; }
```

Visual Basic
---
```text
Public Property IsFilteredBySheet As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsFilteredBySheet {
	bool get ();
	void set (bool value);
}
```

# Remarks
If the schedule is set to filter by sheet, and it is placed on a particular sheet, the instance created will present only the elements visible in the Viewport(s) on that sheet.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The schedule category is not supported to use filter by sheet. -or- When setting this property: The Schedule is split already. |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace